{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"batch_input_shape": [null, 143, 27], "input_length": 143, "forget_bias_init": "one", "inner_activation": "hard_sigmoid", "consume_less": "cpu", "inner_init": "orthogonal", "stateful": false, "input_dim": 27, "trainable": true, "dropout_U": 0.0, "b_regularizer": null, "return_sequences": true, "input_dtype": "float32", "unroll": false, "go_backwards": false, "name": "lstm_15", "W_regularizer": null, "output_dim": 27, "dropout_W": 0.0, "init": "glorot_uniform", "U_regularizer": null, "activation": "softmax"}}]}