{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "W_constraint": null, "input_dtype": "int32", "trainable": true, "dropout": 0.0, "input_length": 4563, "name": "embedding_4", "batch_input_shape": [null, 4563], "init": "uniform", "output_dim": 24, "input_dim": 27, "W_regularizer": null, "mask_zero": false}}, {"class_name": "LSTM", "config": {"inner_init": "orthogonal", "trainable": true, "unroll": false, "input_length": null, "consume_less": "cpu", "name": "lstm_4", "forget_bias_init": "one", "input_dim": 24, "go_backwards": false, "output_dim": 100, "stateful": false, "init": "glorot_uniform", "dropout_W": 0.0, "W_regularizer": null, "U_regularizer": null, "dropout_U": 0.0, "b_regularizer": null, "inner_activation": "hard_sigmoid", "activation": "tanh", "return_sequences": false}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "name": "dense_4", "init": "glorot_uniform", "output_dim": 1, "input_dim": null, "W_regularizer": null, "b_constraint": null, "activation": "sigmoid"}}], "keras_version": "1.1.0"}