{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 27, "dropout": 0.0, "activity_regularizer": null, "batch_input_shape": [null, 4563], "W_regularizer": null, "init": "uniform", "mask_zero": false, "trainable": true, "input_dtype": "int32", "name": "embedding_1", "W_constraint": null, "input_dim": 27, "input_length": 4563}}, {"class_name": "LSTM", "config": {"b_regularizer": null, "input_length": null, "trainable": true, "consume_less": "cpu", "output_dim": 50, "stateful": false, "W_regularizer": null, "return_sequences": false, "go_backwards": false, "inner_activation": "hard_sigmoid", "unroll": false, "dropout_W": 0.0, "init": "glorot_uniform", "forget_bias_init": "one", "activation": "tanh", "name": "lstm_6", "U_regularizer": null, "input_dim": 27, "inner_init": "orthogonal", "dropout_U": 0.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "output_dim": 1, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activation": "sigmoid", "name": "dense_3", "W_constraint": null, "input_dim": null}}], "keras_version": "1.1.0"}