{"keras_version": "1.1.0", "config": [{"config": {"input_length": 4563, "activity_regularizer": null, "init": "uniform", "W_constraint": null, "output_dim": 27, "batch_input_shape": [null, 4563], "dropout": 0.0, "mask_zero": false, "name": "embedding_1", "trainable": true, "W_regularizer": null, "input_dim": 27, "input_dtype": "int32"}, "class_name": "Embedding"}, {"config": {"input_length": null, "forget_bias_init": "one", "init": "glorot_uniform", "unroll": false, "output_dim": 50, "go_backwards": false, "inner_activation": "hard_sigmoid", "dropout_U": 0.0, "U_regularizer": null, "dropout_W": 0.0, "activation": "tanh", "name": "lstm_1", "trainable": true, "W_regularizer": null, "stateful": false, "b_regularizer": null, "consume_less": "cpu", "return_sequences": false, "input_dim": 27, "inner_init": "orthogonal"}, "class_name": "LSTM"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "output_dim": 1, "activity_regularizer": null, "b_constraint": null, "activation": "sigmoid", "name": "dense_1", "trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}